{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/johniselin/finesandfees_baltimore/logs/vacant_results_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 May 2019, 13:20:29
{txt}
{com}. 
. use "data_cleaned/vacant_lots_cleaned_merge.dta"
{txt}
{com}. 
. gen year = year(notice_date)
{txt}(1 missing value generated)

{com}. 
. tab year

       {txt}year {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
       1993 {c |}{res}          1        0.01        0.01
{txt}       1994 {c |}{res}          1        0.01        0.01
{txt}       1995 {c |}{res}          1        0.01        0.02
{txt}       1997 {c |}{res}          3        0.02        0.04
{txt}       1998 {c |}{res}          2        0.01        0.05
{txt}       1999 {c |}{res}          3        0.02        0.07
{txt}       2000 {c |}{res}          1        0.01        0.07
{txt}       2001 {c |}{res}          3        0.02        0.09
{txt}       2002 {c |}{res}          4        0.02        0.12
{txt}       2003 {c |}{res}          7        0.04        0.16
{txt}       2004 {c |}{res}        178        1.08        1.24
{txt}       2005 {c |}{res}        435        2.63        3.87
{txt}       2006 {c |}{res}        609        3.69        7.56
{txt}       2007 {c |}{res}      1,018        6.17       13.73
{txt}       2008 {c |}{res}      1,153        6.98       20.71
{txt}       2009 {c |}{res}        693        4.20       24.91
{txt}       2010 {c |}{res}        793        4.80       29.71
{txt}       2011 {c |}{res}        852        5.16       34.87
{txt}       2012 {c |}{res}        805        4.88       39.75
{txt}       2013 {c |}{res}        753        4.56       44.31
{txt}       2014 {c |}{res}        886        5.37       49.68
{txt}       2015 {c |}{res}      1,270        7.69       57.37
{txt}       2016 {c |}{res}      1,577        9.55       66.92
{txt}       2017 {c |}{res}      2,185       13.24       80.16
{txt}       2018 {c |}{res}      2,937       17.79       97.95
{txt}       2019 {c |}{res}        339        2.05      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     16,509      100.00
{txt}
{com}. 
. tab neighborhoods_csa , sort

                           {txt}ï»¿CSA2010 {c |}      Freq.     Percent        Cum.
{hline 38}{c +}{hline 35}
                  Southwest Baltimore {c |}{res}      2,495       15.11       15.11
{txt}      Sandtown-Winchester/Harlem Park {c |}{res}      2,076       12.57       27.69
{txt}                        Clifton-Berea {c |}{res}      1,665       10.08       37.77
{txt}                     Greater Rosemont {c |}{res}      1,179        7.14       44.91
{txt}                    Midway/Coldstream {c |}{res}        858        5.20       50.11
{txt}            Pimlico/Arlington/Hilltop {c |}{res}        849        5.14       55.25
{txt}                      Greenmount East {c |}{res}        753        4.56       59.81
{txt}                  Upton/Druid Heights {c |}{res}        635        3.85       63.66
{txt}            Penn North/Reservoir Hill {c |}{res}        569        3.45       67.10
{txt}                Southern Park Heights {c |}{res}        535        3.24       70.35
{txt}                     Madison/East End {c |}{res}        531        3.22       73.56
{txt}                    Greater Mondawmin {c |}{res}        521        3.16       76.72
{txt}                  Oldtown/Middle East {c |}{res}        393        2.38       79.10
{txt}        Allendale/Irvington/S. Hilton {c |}{res}        334        2.02       81.12
{txt}    Brooklyn/Curtis Bay/Hawkins Point {c |}{res}        331        2.00       83.13
{txt}                        Belair-Edison {c |}{res}        251        1.52       84.65
{txt}          Patterson Park North & East {c |}{res}        210        1.27       85.92
{txt}           Washington Village/Pigtown {c |}{res}        179        1.08       87.00
{txt}Poppleton/The Terraces/Hollins Market {c |}{res}        170        1.03       88.03
{txt}                 Forest Park/Walbrook {c |}{res}        168        1.02       89.05
{txt}                        The Waverlies {c |}{res}        160        0.97       90.02
{txt}      Greater Charles Village/Barclay {c |}{res}        155        0.94       90.96
{txt}       Westport/Mount Winans/Lakeland {c |}{res}        142        0.86       91.82
{txt}                       Greater Govans {c |}{res}        136        0.82       92.64
{txt}                    Edmondson Village {c |}{res}        118        0.71       93.36
{txt}                 Dorchester/Ashburton {c |}{res}        111        0.67       94.03
{txt}        Orangeville/East Highlandtown {c |}{res}         81        0.49       94.52
{txt}                           Lauraville {c |}{res}         73        0.44       94.96
{txt}           Howard Park/West Arlington {c |}{res}         70        0.42       95.38
{txt}                  Downtown/Seton Hill {c |}{res}         62        0.38       95.76
{txt} Medfield/Hampden/Woodberry/Remington {c |}{res}         62        0.38       96.14
{txt}                          Cherry Hill {c |}{res}         59        0.36       96.49
{txt}             Morrell Park/Violetville {c |}{res}         57        0.35       96.84
{txt}                    Cedonia/Frankford {c |}{res}         55        0.33       97.17
{txt}                              Midtown {c |}{res}         52        0.31       97.49
{txt}                       Glen-Fallstaff {c |}{res}         47        0.28       97.77
{txt}                          Fells Point {c |}{res}         41        0.25       98.02
{txt}            Chinquapin Park/Belvedere {c |}{res}         37        0.22       98.24
{txt}                             Hamilton {c |}{res}         37        0.22       98.47
{txt}      Beechfield/Ten Hills/West Hills {c |}{res}         35        0.21       98.68
{txt}            Inner Harbor/Federal Hill {c |}{res}         28        0.17       98.85
{txt}                         Highlandtown {c |}{res}         23        0.14       98.99
{txt}                           Loch Raven {c |}{res}         23        0.14       99.13
{txt}                            Northwood {c |}{res}         23        0.14       99.27
{txt}                         Southeastern {c |}{res}         23        0.14       99.41
{txt}             Harbor East/Little Italy {c |}{res}         22        0.13       99.54
{txt}    North Baltimore/Guilford/Homeland {c |}{res}         22        0.13       99.67
{txt}                               Canton {c |}{res}         21        0.13       99.80
{txt}                     Harford/Echodale {c |}{res}         17        0.10       99.90
{txt}             Dickeyville/Franklintown {c |}{res}          5        0.03       99.93
{txt}      Greater Roland Park/Poplar Hill {c |}{res}          4        0.02       99.96
{txt}          Mount Washington/Coldspring {c |}{res}          4        0.02       99.98
{txt}                  Claremont/Armistead {c |}{res}          1        0.01       99.99
{txt}              Cross-Country/Cheswolde {c |}{res}          1        0.01       99.99
{txt}                      South Baltimore {c |}{res}          1        0.01      100.00
{txt}{hline 38}{c +}{hline 35}
                                Total {c |}{res}     16,510      100.00
{txt}
{com}. tab quint_poverty  , sort

  {txt}Quintiles by {c |}
      Share of {c |}
  Residents in {c |}
       Poverty {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
29.2% to 47.7% {c |}{res}      9,173       55.56       55.56
{txt}20.3% to 26.3% {c |}{res}      4,047       24.51       80.07
{txt}15.4% to 19.9% {c |}{res}      2,413       14.62       94.69
{txt}10.0% to 15.1% {c |}{res}        556        3.37       98.06
{txt}  0.8% to 8.1% {c |}{res}        321        1.94      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     16,510      100.00
{txt}
{com}. tab quint_black , sort

  {txt}Quintiles by {c |}
Black Share of {c |}
     Residents {c |}      Freq.     Percent        Cum.
{hline 15}{c +}{hline 35}
93.8% to 96.6% {c |}{res}      7,975       48.30       48.30
{txt}84.9% to 93.5% {c |}{res}      3,859       23.37       71.68
{txt}63.1% to 84.6% {c |}{res}      3,159       19.13       90.81
{txt}31.2% to 63.1% {c |}{res}      1,110        6.72       97.53
{txt} 1.7% to 29.8% {c |}{res}        407        2.47      100.00
{txt}{hline 15}{c +}{hline 35}
         Total {c |}{res}     16,510      100.00
{txt}
{com}. tab quint_workingage , sort

{txt}5 quantiles {c |}
         of {c |}
working_16  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          2 {c |}{res}      6,937       42.02       42.02
{txt}          3 {c |}{res}      4,161       25.20       67.22
{txt}          1 {c |}{res}      2,370       14.35       81.57
{txt}          4 {c |}{res}      2,341       14.18       95.75
{txt}          5 {c |}{res}        701        4.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     16,510      100.00
{txt}
{com}. tab quint_female_head , sort

{txt}5 quantiles {c |}
         of {c |}
female_head {c |}
       _16  {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          4 {c |}{res}      7,557       45.77       45.77
{txt}          5 {c |}{res}      6,274       38.00       83.77
{txt}          3 {c |}{res}      1,348        8.16       91.94
{txt}          2 {c |}{res}        841        5.09       97.03
{txt}          1 {c |}{res}        490        2.97      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     16,510      100.00
{txt}
{com}. 
. collapse (count) zipcodes (mean) perc_black_16 perc_households_below_pov, by(neighborhoods_csa)
{txt}
{com}. 
. rename zipcodes count
{res}{txt}
{com}. label variable count "Count of vacant homes"
{txt}
{com}. label variable perc_black_16 "Black share of population"
{txt}
{com}. label variable perc_households_below_pov  "Share of population in poverty"
{txt}
{com}. 
. twoway scatter count perc_black_16
{res}{txt}
{com}. graph export "vacant_by_black_scatter.pdf", replace
{txt}(file /Users/johniselin/finesandfees_baltimore/vacant_by_black_scatter.pdf written in PDF format)

{com}. twoway scatter count perc_households_below_pov
{res}{txt}
{com}. graph export "vacant_by_poverty_scatter.pdf", replace
{txt}(file /Users/johniselin/finesandfees_baltimore/vacant_by_poverty_scatter.pdf written in PDF format)

{com}. 
. clear
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/johniselin/finesandfees_baltimore/logs/vacant_results_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}15 May 2019, 13:20:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}